### Problem Statement

Predicting Survival in the Titanic Data Set
We will be using a decision tree to make predictions about the Titanic data set from
Kaggle. This data set provides information on the Titanic passengers and can be used to
predict whether a passenger survived or not.
Loading Data and modules
import numpy as np
import pandas as pd
import seaborn as sb
import matplotlib.pyplot as plt
import sklearn
from pandas import Series, DataFrame
from pylab import rcParams
from sklearn import preprocessing
from sklearn.linear_model import LogisticRegression
from sklearn.cross_validation import train_test_split
from sklearn import metrics

from sklearn.metrics import classification_report
Url=
https://raw.githubusercontent.com/BigDataGal/Python-for-Data-Science/master/titanic
-train.csv
titanic = pd.read_csv(url)
titanic.columns =
['PassengerId','Survived','Pclass','Name','Sex','Age','SibSp','Parch','Ticket','Fare','Cabin','E
mbarked']
You use only Pclass, Sex, Age, SibSp (Siblings aboard), Parch (Parents/children aboard),
and Fare to predict whether a passenger survived.

In [88]:
import pandas as pd
import numpy as np
from sklearn import model_selection,tree,metrics

##### Load data

In [89]:
Url= "https://raw.githubusercontent.com/BigDataGal/Python-for-Data-Science/master/titanic-train.csv"
df=pd.read_csv(Url)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

##### Convert Categorical variables into numeric forms

In [90]:
df['Sex_num'],_ = pd.factorize(df['Sex'])

##### fill null values in age columns with mean

In [91]:
df['Age']=df['Age'].fillna(df['Age'].mean())

##### Select features

In [92]:
y=df['Survived']
X=df[['Pclass', 'Sex_num', 'Age', 'SibSp', 'Parch','Fare']]
X.head()

   Pclass  Sex_num   Age  SibSp  Parch     Fare
0       3        0  22.0      1      0   7.2500
1       1        1  38.0      1      0  71.2833
2       3        1  26.0      0      0   7.9250
3       1        1  35.0      1      0  53.1000
4       3        0  35.0      0      0   8.0500

##### Split the data  randomly  into 70% data and 30 % for test

In [93]:
X_train,X_test,y_train,y_test = model_selection.train_test_split(X,y,test_size=.3)

##### Train model

In [106]:
dtree=tree.DecisionTreeClassifier(criterion='entropy',max_depth=4,random_state=0)
dtree.fit(X_train,y_train)

DecisionTreeClassifier(class_weight=None, criterion='entropy', max_depth=4,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=0,
            splitter='best')

##### use model to make predictions with test data

In [107]:
y_pred = dtree.predict(X_test)

##### performence test

In [111]:
count_misclassified = (y_test != y_pred).sum()
print('Misclassified samples are {} out of {}'.format(count_misclassified,len(y_test)))

Misclassified samples are 52 out of 268

In [112]:
accuracy = metrics.accuracy_score(y_test,y_pred)
print('Accuracy {:.2f}'.format(accuracy))

Accuracy 0.81